
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam_group["rsschool-devops-course"].aws_iam_group_policy_attachment.enforce_MFA will be created
  + resource "aws_iam_group_policy_attachment" "enforce_MFA" {
      + group      = "rsschool-devops-course"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::084912621610:policy/rsschool-devops-course-enforce_mfa"
    }

  # module.iam_user["rsschool-user"].data.aws_iam_policy_document.permission_boundaries will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "permission_boundaries" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:*",
              + "cloudwatch:*",
              + "ec2:*",
              + "elasticloadbalancing:*",
              + "events:*",
              + "iam:*",
              + "kms:*",
              + "pipes:*",
              + "route53:*",
              + "route53domains:*",
              + "s3:*",
              + "scheduler:*",
              + "schemas:*",
              + "sqs:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ServiceBoundaries"
        }
    }

  # module.iam_user["rsschool-user"].aws_iam_policy.this will be updated in-place
  ~ resource "aws_iam_policy" "this" {
        id               = "arn:aws:iam::084912621610:policy/rsschool-user-permission_boundaries_policy"
        name             = "rsschool-user-permission_boundaries_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "schemas:*",
                          - "scheduler:*",
                          - "s3:*",
                          - "route53domains:*",
                          - "route53:*",
                          - "pipes:*",
                          - "kms:*",
                          - "iam:*",
                          - "events:*",
                          - "elasticloadbalancing:*",
                          - "ec2:*",
                          - "logs:*",
                          - "cloudwatch:*",
                          - "autoscaling:*",
                          - "sts:DecodeAuthorizationMessage",
                          - "ec2-instance-connect:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ServiceBoundaries"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "rsschool-devops-course"
            "Task"        = "01"
        }
        # (7 unchanged attributes hidden)
    }

  # module.oidc_role["GithubActionsRole"].aws_iam_policy.this will be updated in-place
  ~ resource "aws_iam_policy" "this" {
        id               = "arn:aws:iam::084912621610:policy/GithubActionsRole-permission_boundaries_policy"
        name             = "GithubActionsRole-permission_boundaries_policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (6 unchanged elements hidden)
                            "pipes:*",
                          - "kms:*",
                            "iam:*",
                            # (4 unchanged elements hidden)
                            "autoscaling:*",
                          - "logs:*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "rsschool-devops-course"
            "Task"        = "01"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.